# 4. Пользователь вводит строку из нескольких слов, разделённых пробелами.
# Вывести каждое слово с новой строки. Строки необходимо пронумеровать.
# Если в слово длинное, выводить только первые 10 букв в слове.

long_string = input("Введите строку из нескольких слов: ")
list_str = long_string.split(" ")
for el in enumerate(list_str):
    print(f"Номер слова: {el[0]+1} , обрезанное до 10 симв слово: {el[1][:10]}")