# 5. Запросите у пользователя значения выручки и издержек фирмы. Определите, с каким финансовым результатом
# работает фирма (прибыль — выручка больше издержек, или убыток — издержки больше выручки).
# Выведите соответствующее сообщение. Если фирма отработала с прибылью,
# вычислите рентабельность выручки (соотношение прибыли к выручке).
# Далее запросите численность сотрудников фирмы и определите прибыль фирмы в расчете на одного сотрудника.
from builtins import input

revenue = float(input("Укажите сумму выручки, руб.: "))
expenses = float(input("Укажите сумму расходов, руб.: "))

profit = revenue - expenses

if profit > 0:
    print(f"Компания работает с прибылью, руб.: {profit}")
    if revenue != 0:
        profitability = profit/revenue
        print(f"Рентабельность компании: {round(profitability*100, 2)}%")
        count_workers = int(input("Укажите численность сотрудников, чел.: "))
        if count_workers != 0:
            print(f"Прибыль на одного работника составляет: {round(profit/count_workers, 2)} руб.")
else:
    print(f"Компания работает с убытком: {-profit}")


