"""
1. Создать класс TrafficLight (светофор).
определить у него один атрибут color (цвет) и метод running (запуск);
атрибут реализовать как приватный;
в рамках метода реализовать переключение светофора в режимы: красный, жёлтый, зелёный;
продолжительность первого состояния (красный) составляет 7 секунд,
второго (жёлтый) — 2 секунды, третьего (зелёный) — на ваше усмотрение;

переключение между режимами должно осуществляться только в указанном порядке (красный, жёлтый, зелёный);
проверить работу примера, создав экземпляр и вызвав описанный метод.

Задачу можно усложнить, реализовав проверку порядка режимов.
При его нарушении выводить соответствующее сообщение и завершать скрипт.
"""
import time
from itertools import cycle

class TrafficLight:
    mode = {"Красный": 7, "Желтый": 2, "Зеленый": 3} # создадим режим работы светофора по умолчанию

    def __init__(self, __color):
        self.__color = __color
        print(f"Создан светофор, со стартовым цветом:{self.__color}")
        # print(list(mode.items()))
        # print(list(mode.keys()).index("Желтый"))

    #  создадим функцию сдвига списка вправо + или влево -, чтобы можно было инициализировать световор с любого цвета,
    #  при этом последовательность сдвигалась
    @staticmethod
    def shift(seq, shift=1):
        return seq[-shift:] + seq[:-shift]

    def running(self):
        # получим новый режим работы светофора в зависимости от цвета инициализации экземпляра класса
        new_mode = dict(self.shift(list(self.mode.items()), list(self.mode.keys()).index(self.__color) + 1))

        # т.к. светофор это циклическая сущность, то зациклим его работу методом cycle
        for num, el in enumerate(cycle(new_mode), 1):
            print(f"{num} Цвет светофора: {el}, длительность {new_mode[el]} сек.")
            time.sleep(new_mode[el])
            # сделаем принудительный выход, чтобы избежать бесконечного цикла
            # т.к. в реализации данного касса невозможно нарушить последовательность
            # возможно я перемудрил с выполнением задания :)
            if num > 10: break

# инициируем создание экземпляра светофора с любого цвета
TrLight_1 = TrafficLight("Желтый")
TrLight_1.running()

