"""
6. Реализовать два небольших скрипта:
а) итератор, генерирующий целые числа, начиная с указанного,
б) итератор, повторяющий элементы некоторого списка, определенного заранее.
Подсказка: использовать функцию count() и cycle() модуля itertools.
Обратите внимание, что создаваемый цикл не должен быть бесконечным. Необходимо предусмотреть условие его завершения.
Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл.
Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.
"""
import itertools
# Скрипт а)
def sequence_int(begin_number, qantity):
    count = 1
    for i in itertools.count(begin_number):
        count += 1
        yield i
        # print(count, i)
        if count > qantity:
            break

a = int(input("Введите число первого элемента последовательности: "))
qantity = int(input("Введите количество членов последовательности: "))

gen = sequence_int(a, qantity)

for i in gen:
    print(i)