# 2. Для списка реализовать обмен значений соседних элементов,
# т.е. Значениями обмениваются элементы с индексами 0 и 1, 2 и 3 и т.д.
# При нечетном количестве элементов последний сохранить на своем месте.
# Для заполнения списка элементов необходимо использовать функцию input().

len_list = int(input("Укажите количество элементов списка: "))
# Заполним спосок
my_list = []
for i in range(len_list):
    new_el = input(f'Введите значение {i} элемента: ')
    my_list.append(new_el)

#Переставим элементы местами, пройдясь по четным элементам списка
for i in range(0, len_list, 2):
    if i == len_list-1 and len_list%2 == 1:
        break
    buffer = my_list[i]
    my_list[i] = my_list[i+1]
    my_list[i + 1] = buffer

print(my_list)




