# 6. Спортсмен занимается ежедневными пробежками.
# В первый день его результат составил a километров.
# Каждый день спортсмен увеличивал результат на 10 % относительно предыдущего.
# Требуется определить номер дня, на который общий результат спортсмена составить не менее b километров.
# Программа должна принимать значения параметров a и b и выводить одно натуральное число — номер дня.

km_day = float(input("Введите километраж первого дня: "))
km_total = float(input("Введите километраж, который необходимо достичь: "))

day = 1
km_current = km_day
while km_current < km_total:
    km_current = km_current*1.1
    day += 1
print(f"На {day} день спортмен пробежит {km_current} км и привысит результат {km_total} км")