# Реализовать функцию int_func(), принимающую слово из маленьких латинских букв и возвращающую его же,
# но с прописной первой буквой. Например, print(int_func(‘text’)) -> Text.
# Продолжить работу над заданием. В программу должна попадать строка из слов, разделенных пробелом.
# Каждое слово состоит из латинских букв в нижнем регистре. Сделать вывод исходной строки, но каждое слово должно
# начинаться с заглавной буквы. Необходимо использовать написанную ранее функцию int_func().

import re # импортнем библиотеку регулярных выражений, для проверки на латинские символы

def int_func(word:str):
    if re.search(r'[^a-z ]',word):
        return "Вы ввели нелатинские буквы или нестрочные"
    return word.lower().title()

word_in = input("Введите слова через пробел: ")
print(int_func(word_in))