# 2. Представлен список чисел. Необходимо вывести элементы исходного списка,
# значения которых больше предыдущего элемента.
# Подсказка: элементы, удовлетворяющие условию, оформить в виде списка.
# Для формирования списка использовать генератор.
# Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
# Результат: [12, 44, 4, 10, 78, 123].

import random

len_list = int(input("Укажите количество элементов списка: "))
# my_list = [random.randint(0, 100) for i in range(len_list)]
my_list = random.sample(range(0,100), len_list) # только тут значения списка никогда не повторятся

print(my_list)

my_list_out = [el for el in my_list if (my_list.index(el) > 0 and el > my_list[my_list.index(el)-1])]

print(my_list_out)
