# 1. Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента. Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

my_list = ['Строка', 45, 445.354, [1,2,4], (5,6,8), set('abrakadabra'), {'Jan': 1, 'Feb': 2, 'Mar': 3, 'Apr': 4}]
for el in my_list:
    print(f"{type(el)} : {el}")


