# Задание 1

string_a = "строка а"
int_b = 10
list_ab = [string_a, int_b]
print(string_a, int_b, list_ab)

first_name = input("Введите ваше имя: ")
last_name = input("Введите вашу фамилию: ")
age = int(input("Сколько вам лет: "))

print("Вас зовут: ", first_name, last_name)
print("Ваш возраст: ", age)
