"""
1. Создать программно файл в текстовом формате, записать в него построчно данные,
вводимые пользователем. Об окончании ввода данных свидетельствует пустая строка.
"""
with open("text_file_hw01.txt", 'w', encoding="utf-8") as file_obj:
    print("Введите строки для записи в файл, для окончания ввода введите пустую строку:")
    while True:
        str_for_file = input()
        if str_for_file == "":
            break
        file_obj.write(str_for_file+"\n")
